-- 사용자 데이터 삽입
INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
-- 1월 사용자
('user01@example.com', NULL, 'User01', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-01-01 00:00:00', '2024-01-01 00:00:00'),
('user02@example.com', NULL, 'User02', 'NONE', 'BANNED', 'USER', NULL, NULL, '2024-01-05 00:00:00', '2024-01-05 00:00:00'),
('user03@example.com', NULL, 'User03', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-01-10 00:00:00', '2024-01-10 00:00:00'),
('user04@example.com', NULL, 'User04', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-01-15 00:00:00', '2024-01-15 00:00:00'),
('user05@example.com', NULL, 'User05', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-01-20 00:00:00', '2024-01-20 00:00:00'),
('user06@example.com', NULL, 'User06', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-01-20 00:00:00', '2024-01-20 00:00:00');

INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
-- 2월 사용자
('user07@example.com', NULL, 'User07', 'NONE', 'BANNED', 'USER', NULL, NULL, '2024-02-01 00:00:00', '2024-02-01 00:00:00'),
('user08@example.com', NULL, 'User08', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-02-05 00:00:00', '2024-02-05 00:00:00'),
('user09@example.com', NULL, 'User09', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-02-10 00:00:00', '2024-02-10 00:00:00'),
('user10@example.com', NULL, 'User10', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-02-15 00:00:00', '2024-02-15 00:00:00'),
('user11@example.com', NULL, 'User11', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-02-20 00:00:00', '2024-02-20 00:00:00');

INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
-- 3월 사용자
('user12@example.com', NULL, 'User12', 'NONE', 'BANNED', 'USER', NULL, NULL, '2024-03-01 00:00:00', '2024-03-01 00:00:00'),
('user13@example.com', NULL, 'User13', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-03-05 00:00:00', '2024-03-05 00:00:00'),
('user14@example.com', NULL, 'User14', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-03-10 00:00:00', '2024-03-10 00:00:00'),
('user15@example.com', NULL, 'User15', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-03-15 00:00:00', '2024-03-15 00:00:00'),
('user16@example.com', NULL, 'User16', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-03-20 00:00:00', '2024-03-20 00:00:00'),
('user17@example.com', NULL, 'User17', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-03-20 00:00:00', '2024-03-20 00:00:00'),
('user18@example.com', NULL, 'User18', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-03-20 00:00:00', '2024-03-20 00:00:00');

INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
-- 4월 사용자
('user19@example.com', NULL, 'User19', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-04-01 00:00:00', '2024-04-01 00:00:00'),
('user20@example.com', NULL, 'User20', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-04-05 00:00:00', '2024-04-05 00:00:00'),
('user21@example.com', NULL, 'User21', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-04-10 00:00:00', '2024-04-10 00:00:00'),
('user22@example.com', NULL, 'User22', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-04-15 00:00:00', '2024-04-15 00:00:00'),
('user23@example.com', NULL, 'User23', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-04-20 00:00:00', '2024-04-20 00:00:00'),
('user24@example.com', NULL, 'User24', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-04-01 00:00:00', '2024-04-01 00:00:00'),
('user25@example.com', NULL, 'User25', 'NONE', 'BANNED', 'USER', NULL, NULL, '2024-04-05 00:00:00', '2024-04-05 00:00:00'),
('user26@example.com', NULL, 'User26', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-04-10 00:00:00', '2024-04-10 00:00:00'),
('user27@example.com', NULL, 'User27', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-04-15 00:00:00', '2024-04-15 00:00:00'),
('user28@example.com', NULL, 'User28', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-04-20 00:00:00', '2024-04-20 00:00:00');

INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
-- 5월 사용자
('user29@example.com', NULL, 'User29', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-05-01 00:00:00', '2024-05-01 00:00:00'),
('user30@example.com', NULL, 'User30', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-05-05 00:00:00', '2024-05-05 00:00:00'),
('user31@example.com', NULL, 'User31', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-05-10 00:00:00', '2024-05-10 00:00:00'),
('user32@example.com', NULL, 'User32', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-05-15 00:00:00', '2024-05-15 00:00:00'),
('user33@example.com', NULL, 'User33', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-05-20 00:00:00', '2024-05-20 00:00:00'),
('user34@example.com', NULL, 'User34', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-05-01 00:00:00', '2024-05-01 00:00:00'),
('user35@example.com', NULL, 'User35', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-05-05 00:00:00', '2024-05-05 00:00:00'),
('user36@example.com', NULL, 'User36', 'NONE', 'BANNED', 'USER', NULL, NULL, '2024-05-10 00:00:00', '2024-05-10 00:00:00'),
('user37@example.com', NULL, 'User37', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-05-15 00:00:00', '2024-05-15 00:00:00'),
('user38@example.com', NULL, 'User38', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-05-20 00:00:00', '2024-05-20 00:00:00');

INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
-- 6월 사용자
('user39@example.com', NULL, 'User39', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-06-01 00:00:00', '2024-06-01 00:00:00'),
('user40@example.com', NULL, 'User40', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-06-05 00:00:00', '2024-06-05 00:00:00'),
('user41@example.com', NULL, 'User41', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-06-10 00:00:00', '2024-06-10 00:00:00'),
('user42@example.com', NULL, 'User42', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-06-15 00:00:00', '2024-06-15 00:00:00'),
('user43@example.com', NULL, 'User43', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-06-20 00:00:00', '2024-06-20 00:00:00'),
('user44@example.com', NULL, 'User44', 'NONE', 'BANNED', 'USER', NULL, NULL, '2024-06-01 00:00:00', '2024-06-01 00:00:00'),
('user45@example.com', NULL, 'User45', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-06-05 00:00:00', '2024-06-05 00:00:00'),
('user46@example.com', NULL, 'User46', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-06-10 00:00:00', '2024-06-10 00:00:00'),
('user47@example.com', NULL, 'User47', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-06-15 00:00:00', '2024-06-15 00:00:00'),
('user48@example.com', NULL, 'User48', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-06-20 00:00:00', '2024-06-20 00:00:00');

INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
-- 7월 사용자
('user49@example.com', NULL, 'User49', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-07-01 00:00:00', '2024-07-01 00:00:00'),
('user50@example.com', NULL, 'User50', 'NONE', 'BANNED', 'USER', NULL, NULL, '2024-07-05 00:00:00', '2024-07-05 00:00:00'),
('user51@example.com', NULL, 'User51', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-07-10 00:00:00', '2024-07-10 00:00:00'),
('user52@example.com', NULL, 'User52', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-07-15 00:00:00', '2024-07-15 00:00:00'),
('user53@example.com', NULL, 'User53', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-07-20 00:00:00', '2024-07-20 00:00:00');

INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
-- 8월 사용자
('user54@example.com', NULL, 'User54', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-08-01 00:00:00', '2024-08-01 00:00:00'),
('user55@example.com', NULL, 'User55', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-08-05 00:00:00', '2024-08-05 00:00:00'),
('user56@example.com', NULL, 'User56', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-08-10 00:00:00', '2024-08-10 00:00:00'),
('user57@example.com', NULL, 'User57', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-08-15 00:00:00', '2024-08-15 00:00:00'),
('user58@example.com', NULL, 'User58', 'NONE', 'DISABLED', 'USER', NULL, NULL, '2024-08-20 00:00:00', '2024-08-20 00:00:00');

INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
-- 9월 사용자
('user59@example.com', NULL, 'User59', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-09-01 00:00:00', '2024-09-01 00:00:00'),
('user60@example.com', NULL, 'User60', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-09-05 00:00:00', '2024-09-05 00:00:00'),
('user61@example.com', NULL, 'User61', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-09-10 00:00:00', '2024-09-10 00:00:00'),
('user62@example.com', NULL, 'User62', 'NONE', 'ACTIVE', 'USER', NULL, NULL, '2024-09-15 00:00:00', '2024-09-15 00:00:00'),
('user63@example.com', NULL, 'User63', 'NONE', 'REPORTED', 'USER', NULL, NULL, '2024-09-20 00:00:00', '2024-09-20 00:00:00');

INSERT into local_account(password)
values
('qweasdzxc123');

INSERT INTO users (email, name, nickname, gender, user_status, user_role, profile_image_url, local_id, created_at, modified_at)
VALUES
('sola201@naver.com', NULL, 'User64', 'NONE', 'ACTIVE', 'USER', NULL, 1, '2024-09-20 00:00:00', '2024-09-20 00:00:00');


INSERT INTO black_list (user_id, cumulative_number ,expires_at)
VALUES
(2,4,'2024-09-04 00:00:00'),
(7,12,'2024-09-04 00:00:00'),
(12,5,'2024-09-04 00:00:00'),
(25,5,'2024-09-04 00:00:00'),
(36,36,'2024-09-04 00:00:00'),
(44,5,'2024-09-04 00:00:00'),
(50,5,'2024-09-04 00:00:00');

INSERT into report (user_id, report_reason, description, created_at, modified_at)
values
(11, 'ILLEGAL_CONTENT', '이사람 자꾸 이상한 정보로 사람 불편하게 해요!!!', '2024-01-01 18:00:00','2024-01-01 18:00:00'),
(18, 'INSULT_OR_ABUSE', '욕설을 자꾸 하면 사람 기만합니다.', '2024-02-01 18:00:00','2024-01-01 18:00:00'),
(19, 'ILLEGAL_CONTENT', '이사람 자꾸 이상한 정보로 사람 불편하게 해요!!!', '2024-03-23 18:00:00','2024-01-01 18:00:00'),
(29, 'COMMERCIAL_PROMOTION', '홍보..좀.. 그만 ', '2024-04-21 18:00:00','2024-01-01 18:00:00'),
(35, 'ILLEGAL_CONTENT', '불법 도박 사이트 자꾸 올립니다.', '2024-05-22 18:00:00','2024-01-01 18:00:00'),
(40, 'OBSCENE_CONTENT', '이상한 주소로 자꾸 안내해요', '2024-06-01 18:00:00','2024-01-01 18:00:00'),
(52, 'DUPLICATE_CONTENT', '같은 글을 계속 작성해서 불편해요', '2024-07-01 18:00:00','2024-01-01 18:00:00'),
(55, 'ILLEGAL_CONTENT', '이사람 자꾸 이상한 정보로 사람 불편하게 해요!!!', '2024-08-01 18:00:00','2024-01-01 18:00:00'),
(61, 'PERSONAL_INFO_EXPOSURE', '개인정보 자꾸 노출해요 ㅠㅠ', '2024-09-01 18:00:00','2024-01-01 18:00:00'),
(63, 'FREQUENT_NO_SHOW', '상습적인 프로 불참러입니다.', '2024-10-01 18:00:00','2024-01-01 18:00:00');

INSERT INTO gatherings (b_code, current_number, h_code, max_number, x, y, appointed_at, created_at, deadline, event_gathering_id, hits, modified_at, organizer_id, title, description, address_name, region_1depth_name, region_2depth_name, region_3depth_name, thumbnail_url, concept, gathering_type, goal_distance, status, is_normal_completed)
VALUES
(0, 1, 0, 10,0.0,0.0, '2024-01-01 18:00:00', '2024-01-01 18:00:00', '2024-01-02 18:00:00', NULL,  0, '2024-01-01 18:00:00', 64, '서울 강남구 역삼동', '강남에서의 모임.', '서울특별시 강남구 역삼로 123', '서울특별시', '강남구', '역삼동', 'thumbnail1.jpg', 'RUNLINI', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-01-05 18:00:00', '2024-01-05 18:00:00', '2024-01-06 18:00:00', NULL,  0, '2024-01-05 18:00:00', 64, '부산 해운대구 해운대', '부산에서의 모임.', '부산광역시 해운대구 해운대해변로 140', '부산광역시', '해운대구', '해운대', 'thumbnail2.jpg', 'HEALTH', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-01-10 18:00:00', '2024-01-10 18:00:00', '2024-01-11 18:00:00', NULL,  0, '2024-01-10 18:00:00', 64, '대구 중구 동성로', '대구에서 만나요.', '대구광역시 중구 동성로 123', '대구광역시', '중구', '동성로', 'thumbnail3.jpg', 'GOINMUL', 'GENERAL', 'FIVE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-01-15 18:00:00', '2024-01-15 18:00:00', '2024-01-16 18:00:00', NULL,  0, '2024-01-15 18:00:00', 64, '인천 연수구 송도', '송도에서 만나요.', '인천광역시 연수구 송도동 1', '인천광역시', '연수구', '송도', 'thumbnail4.jpg', 'MARATHON', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-01-20 18:00:00', '2024-01-20 18:00:00', '2024-01-21 18:00:00', NULL,  0, '2024-01-20 18:00:00', 64, '광주 동구 동명동', '광주에서의 모임.', '광주광역시 동구 동명동 1', '광주광역시', '동구', '동명동', 'thumbnail5.jpg', 'MORNING_RUNNING', 'GENERAL', 'FIFTEEN_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-01-25 18:00:00', '2024-01-25 18:00:00', '2024-01-26 18:00:00', NULL,  0, '2024-01-25 18:00:00', 64, '세종시 정부청사', '세종시에서의 모임.', '세종특별자치시 국회대로 1', '세종특별자치시', '세종시', '정부청사', 'thumbnail6.jpg', 'EVENING_RUNNING', 'GENERAL', 'HALF_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0,0.0, '2024-02-01 18:00:00', '2024-02-01 18:00:00', '2024-02-02 18:00:00', NULL,  0, '2024-02-01 18:00:00', 64, '서울 종로구 청계천', '서울의 명소.', '서울특별시 종로구 청계천로 1', '서울특별시', '종로구', '청계천', 'thumbnail7.jpg', 'HEALTH', 'GENERAL', 'FULL_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-02-05 18:00:00', '2024-02-05 18:00:00', '2024-02-06 18:00:00', NULL,  0, '2024-02-05 18:00:00', 64, '부산 사하구 다대포', '다대포에서.', '부산광역시 사하구 다대포해안로 140', '부산광역시', '사하구', '다대포', 'thumbnail8.jpg', 'RUNLINI', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-02-10 18:00:00', '2024-02-10 18:00:00', '2024-02-11 18:00:00', NULL,  0, '2024-02-10 18:00:00', 64, '대구 수성구 수성못', '수성못에서의 모임.', '대구광역시 수성구 수성못2길 1', '대구광역시', '수성구', '수성못', 'thumbnail9.jpg', 'GOINMUL', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-02-15 18:00:00', '2024-02-15 18:00:00', '2024-02-16 18:00:00', NULL,  0, '2024-02-15 18:00:00', 64, '인천 남동구 간석동', '간석동에서의 모임.', '인천광역시 남동구 간석동 1', '인천광역시', '남동구', '간석동', 'thumbnail10.jpg', 'MARATHON', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-02-20 18:00:00', '2024-02-20 18:00:00', '2024-02-21 18:00:00', NULL,  0, '2024-02-20 18:00:00', 64, '광주 광산구 송정역', '송정역에서의 모임.', '광주광역시 광산구 송정동 1', '광주광역시', '광산구', '송정역', 'thumbnail11.jpg', 'MORNING_RUNNING', 'GENERAL', 'FULL_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-02-25 18:00:00', '2024-02-25 18:00:00', '2024-02-26 18:00:00', NULL,  0, '2024-02-25 18:00:00', 64, '세종시 세종청사', '세종청사에서의 모임.', '세종특별자치시 국회대로 1', '세종특별자치시', '세종시', '세종청사', 'thumbnail12.jpg', 'EVENING_RUNNING', 'GENERAL', 'FIFTEEN_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0,0.0, '2024-03-01 18:00:00', '2024-03-01 18:00:00', '2024-03-02 18:00:00', NULL,  0, '2024-03-01 18:00:00', 64, '서울 마포구 홍대', '홍대에서의 모임.', '서울특별시 마포구 양화로 123', '서울특별시', '마포구', '홍대', 'thumbnail13.jpg', 'HEALTH', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-03-05 18:00:00', '2024-03-05 18:00:00', '2024-03-06 18:00:00', NULL,  0, '2024-03-05 18:00:00', 64, '부산 영도구 영도', '영도에서의 모임.', '부산광역시 영도구 해양로 140', '부산광역시', '영도구', '영도', 'thumbnail14.jpg', 'EVENING_RUNNING', 'GENERAL', 'FIFTEEN_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-03-10 18:00:00', '2024-03-10 18:00:00', '2024-03-11 18:00:00', NULL,  0, '2024-03-10 18:00:00', 64, '대구 동구 신천', '신천에서의 모임.', '대구광역시 동구 신천동 1', '대구광역시', '동구', '신천', 'thumbnail15.jpg', 'HEALTH', 'GENERAL', 'FULL_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-03-15 18:00:00', '2024-03-15 18:00:00', '2024-03-16 18:00:00', NULL,  0, '2024-03-15 18:00:00', 64, '인천 미추홀구 주안', '주안에서의 모임.', '인천광역시 미추홀구 주안동 1', '인천광역시', '미추홀구', '주안', 'thumbnail16.jpg', 'HEALTH', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-03-20 18:00:00', '2024-03-20 18:00:00', '2024-03-21 18:00:00', NULL,  0, '2024-03-20 18:00:00', 64, '광주 북구 북동', '북동에서의 모임.', '광주광역시 북구 북동 1', '광주광역시', '북구', '북동', 'thumbnail17.jpg', 'EVENING_RUNNING', 'GENERAL', 'FULL_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-03-25 18:00:00', '2024-03-25 18:00:00', '2024-03-26 18:00:00', NULL,  0, '2024-03-25 18:00:00', 64, '세종시 시청', '세종시청에서의 모임.', '세종특별자치시 시청로 1', '세종특별자치시', '세종시', '세종시청', 'thumbnail18.jpg', 'RUNLINI', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0,0.0, '2024-04-01 18:00:00', '2024-04-01 18:00:00', '2024-04-02 18:00:00', NULL,  0, '2024-04-01 18:00:00', 64, '서울 송파구 잠실', '잠실에서의 모임.', '서울특별시 송파구 올림픽로 1', '서울특별시', '송파구', '잠실', 'thumbnail19.jpg', 'GOINMUL', 'GENERAL', 'FIVE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-04-05 18:00:00', '2024-04-05 18:00:00', '2024-04-06 18:00:00', NULL,  0, '2024-04-05 18:00:00', 64, '부산 동래구 온천', '온천장에서의 모임.', '부산광역시 동래구 온천동 1', '부산광역시', '동래구', '온천', 'thumbnail20.jpg', 'HEALTH', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-04-10 18:00:00', '2024-04-10 18:00:00', '2024-04-11 18:00:00', NULL,  0, '2024-04-10 18:00:00', 64, '대구 서구 비산', '비산동에서의 모임.', '대구광역시 서구 비산동 1', '대구광역시', '서구', '비산', 'thumbnail21.jpg', 'HEALTH', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-04-15 18:00:00', '2024-04-15 18:00:00', '2024-04-16 18:00:00', NULL,  0, '2024-04-15 18:00:00', 64, '인천 남구 숭의동', '숭의동에서의 모임.', '인천광역시 남구 숭의동 1', '인천광역시', '남구', '숭의동', 'thumbnail22.jpg', 'MORNING_RUNNING', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-04-20 18:00:00', '2024-04-20 18:00:00', '2024-04-21 18:00:00', NULL,  0, '2024-04-20 18:00:00', 64, '광주 서구 상무', '상무에서의 모임.', '광주광역시 서구 상무동 1', '광주광역시', '서구', '상무', 'thumbnail23.jpg', 'HEALTH', 'GENERAL', 'FULL_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-04-25 18:00:00', '2024-04-25 18:00:00', '2024-04-26 18:00:00', NULL,  0, '2024-04-25 18:00:00', 64, '세종시 조치원읍', '조치원에서의 모임.', '세종특별자치시 조치원읍 1', '세종특별자치시', '세종시', '조치원', 'thumbnail24.jpg', 'EVENING_RUNNING', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0,0.0, '2024-05-01 18:00:00', '2024-05-01 18:00:00', '2024-05-02 18:00:00', NULL,  0, '2024-05-01 18:00:00', 64, '서울 강서구 화곡', '화곡에서의 모임.', '서울특별시 강서구 화곡로 1', '서울특별시', '강서구', '화곡', 'thumbnail25.jpg', 'GOINMUL', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-05-05 18:00:00', '2024-05-05 18:00:00', '2024-05-06 18:00:00', NULL,  0, '2024-05-05 18:00:00', 64, '부산 해운대구 해운대', '해운대에서의 모임.', '부산광역시 해운대구 해운대해변로 1', '부산광역시', '해운대구', '해운대', 'thumbnail26.jpg', 'HEALTH', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-05-10 18:00:00', '2024-05-10 18:00:00', '2024-05-11 18:00:00', NULL,  0, '2024-05-10 18:00:00', 64, '대구 중구 동성로', '동성로에서의 모임.', '대구광역시 중구 동성로 1', '대구광역시', '중구', '동성로', 'thumbnail27.jpg', 'RUNLINI', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-05-15 18:00:00', '2024-05-15 18:00:00', '2024-05-16 18:00:00', NULL,  0, '2024-05-15 18:00:00', 64, '인천 부평구 부평', '부평에서의 모임.', '인천광역시 부평구 부평동 1', '인천광역시', '부평구', '부평', 'thumbnail28.jpg', 'EVENING_RUNNING', 'GENERAL', 'FULL_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-05-20 18:00:00', '2024-05-20 18:00:00', '2024-05-21 18:00:00', NULL,  0, '2024-05-20 18:00:00', 64, '광주 광산구 광산', '광산구에서의 모임.', '광주광역시 광산구 광산동 1', '광주광역시', '광산구', '광산', 'thumbnail29.jpg', 'MORNING_RUNNING', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-05-25 18:00:00', '2024-05-25 18:00:00', '2024-05-26 18:00:00', NULL,  0, '2024-05-25 18:00:00', 64, '세종시 세종', '세종시에서의 모임.', '세종특별자치시 세종로 1', '세종특별자치시', '세종시', '세종', 'thumbnail30.jpg', 'HEALTH', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0,0.0, '2024-06-01 18:00:00', '2024-06-01 18:00:00', '2024-06-02 18:00:00', NULL,  0, '2024-06-01 18:00:00', 64, '서울 중구 명동', '명동에서의 모임.', '서울특별시 중구 명동 1', '서울특별시', '중구', '명동', 'thumbnail31.jpg', 'HEALTH', 'GENERAL', 'FIFTEEN_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-06-05 18:00:00', '2024-06-05 18:00:00', '2024-06-06 18:00:00', NULL,  0, '2024-06-05 18:00:00', 64, '부산 기장군 기장', '기장에서의 모임.', '부산광역시 기장군 기장읍 1', '부산광역시', '기장군', '기장', 'thumbnail32.jpg', 'RUNLINI', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-06-10 18:00:00', '2024-06-10 18:00:00', '2024-06-11 18:00:00', NULL,  0, '2024-06-10 18:00:00', 64, '대구 수성구 범어', '범어에서의 모임.', '대구광역시 수성구 범어동 1', '대구광역시', '수성구', '범어', 'thumbnail33.jpg', 'RUNLINI', 'GENERAL', 'HALF_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-06-15 18:00:00', '2024-06-15 18:00:00', '2024-06-16 18:00:00', NULL,  0, '2024-06-15 18:00:00', 64, '인천 연수구 송도', '송도에서의 모임.', '인천광역시 연수구 송도동 1', '인천광역시', '연수구', '송도', 'thumbnail34.jpg', 'GOINMUL', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-06-20 18:00:00', '2024-06-20 18:00:00', '2024-06-21 18:00:00', NULL,  0, '2024-06-20 18:00:00', 64, '광주 동구 동명', '동명에서의 모임.', '광주광역시 동구 동명동 1', '광주광역시', '동구', '동명', 'thumbnail35.jpg', 'MARATHON', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-06-25 18:00:00', '2024-06-25 18:00:00', '2024-06-26 18:00:00', NULL,  0, '2024-06-25 18:00:00', 64, '세종시 세종', '세종에서의 모임.', '세종특별자치시 세종로 2', '세종특별자치시', '세종시', '세종', 'thumbnail36.jpg', 'MORNING_RUNNING', 'GENERAL', 'FULL_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0,0.0, '2024-07-01 18:00:00', '2024-07-01 18:00:00', '2024-07-02 18:00:00', NULL,  0, '2024-07-01 18:00:00', 64, '서울 관악구 서울대', '서울대에서의 모임.', '서울특별시 관악구 관악로 1', '서울특별시', '관악구', '서울대', 'thumbnail37.jpg', 'HEALTH', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-07-05 18:00:00', '2024-07-05 18:00:00', '2024-07-06 18:00:00', NULL,  0, '2024-07-05 18:00:00', 64, '부산 사하구 다대포', '다대포에서의 모임.', '부산광역시 사하구 다대포동 1', '부산광역시', '사하구', '다대포', 'thumbnail38.jpg', 'EVENING_RUNNING', 'GENERAL', 'FIVE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-07-10 18:00:00', '2024-07-10 18:00:00', '2024-07-11 18:00:00', NULL,  0, '2024-07-10 18:00:00', 64, '대구 동구 신천', '신천에서의 모임.', '대구광역시 동구 신천동 1', '대구광역시', '동구', '신천', 'thumbnail39.jpg', 'MARATHON', 'GENERAL', 'HALF_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-07-20 18:00:00', '2024-07-20 18:00:00', '2024-07-21 18:00:00', NULL,  0, '2024-07-20 18:00:00', 64, '광주 서구 치평', '치평에서의 모임.', '광주광역시 서구 치평동 1', '광주광역시', '서구', '치평', 'thumbnail41.jpg', 'RUNLINI', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-07-25 18:00:00', '2024-07-25 18:00:00', '2024-07-26 18:00:00', NULL,  0, '2024-07-25 18:00:00', 64, '세종시 세종', '세종시에서의 모임.', '세종특별자치시 세종로 3', '세종특별자치시', '세종시', '세종', 'thumbnail42.jpg', 'HEALTH', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0,0.0, '2024-08-01 18:00:00', '2024-08-01 18:00:00', '2024-08-02 18:00:00', NULL,  0, '2024-08-01 18:00:00', 64, '서울 서대문구 연세대', '연세대에서의 모임.', '서울특별시 서대문구 연세로 1', '서울특별시', '서대문구', '연세대', 'thumbnail43.jpg', 'HEALTH', 'GENERAL', 'FIVE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-08-05 18:00:00', '2024-08-05 18:00:00', '2024-08-06 18:00:00', NULL,  0, '2024-08-05 18:00:00', 64, '부산 기장군 기장', '기장에서의 모임.', '부산광역시 기장군 기장읍 2', '부산광역시', '기장군', '기장', 'thumbnail44.jpg', 'MARATHON', 'GENERAL', 'FULL_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-08-10 18:00:00', '2024-08-10 18:00:00', '2024-08-11 18:00:00', NULL,  0, '2024-08-10 18:00:00', 64, '대구 수성구 범어', '범어에서의 모임.', '대구광역시 수성구 범어동 2', '대구광역시', '수성구', '범어', 'thumbnail45.jpg', 'EVENING_RUNNING', 'GENERAL', 'FIFTEEN_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-08-15 18:00:00', '2024-08-15 18:00:00', '2024-08-16 18:00:00', NULL,  0, '2024-08-15 18:00:00', 64, '인천 연수구 송도', '송도에서의 모임.', '인천광역시 연수구 송도동 3', '인천광역시', '연수구', '송도', 'thumbnail46.jpg', 'MORNING_RUNNING', 'GENERAL', 'THREE_KM', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-08-20 18:00:00', '2024-08-20 18:00:00', '2024-08-21 18:00:00', NULL,  0, '2024-08-20 18:00:00', 64, '광주 동구 동명', '동명에서의 모임.', '광주광역시 동구 동명동 2', '광주광역시', '동구', '동명', 'thumbnail47.jpg', 'HEALTH', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-08-25 18:00:00', '2024-08-25 18:00:00', '2024-08-26 18:00:00', NULL,  0, '2024-08-25 18:00:00', 64, '세종시 세종', '세종시에서의 모임.', '세종특별자치시 세종로 4', '세종특별자치시', '세종시', '세종', 'thumbnail48.jpg', 'RUNLINI', 'GENERAL', 'HALF_MARATHON', 'NORMAL',0),
(0, 1, 0, 10,0.0,0.0, '2024-09-01 18:00:00', '2024-09-01 18:00:00', '2024-09-02 18:00:00', NULL,  0, '2024-09-01 18:00:00', 64, '서울 성동구 성수동', '성수동에서의 모임.', '서울특별시 성동구 성수동 1', '서울특별시', '성동구', '성수동', 'thumbnail49.jpg', 'HEALTH', 'GENERAL', 'FREE', 'NORMAL',0),
(0, 1, 0, 10,0.0, 0.0, '2024-09-05 18:00:00', '2024-09-05 18:00:00', '2024-09-06 18:00:00', NULL,  0, '2024-09-05 18:00:00', 64, '대구 수성구 범어', '범어에서의 모임.', '대구광역시 수성구 범어동 3', '대구광역시', '수성구', '범어', 'thumbnail50.jpg', 'HEALTH', 'GENERAL', 'THREE_KM', 'NORMAL',0);

-- 이벤트 테이블
INSERT INTO event_gathering(created_at, modified_at, status) VALUES
('2024-01-01 18:00:00', '2024-01-01 18:00:00', 'APPROVED'),
('2024-01-05 18:00:00', '2024-01-05 18:00:00', 'APPROVED'),
('2024-01-10 18:00:00', '2024-01-10 18:00:00', 'APPROVED'),
('2024-02-01 18:00:00', '2024-02-01 18:00:00', 'APPROVED'),
('2024-02-05 18:00:00', '2024-02-05 18:00:00', 'APPROVED'),
('2024-03-01 18:00:00', '2024-03-01 18:00:00', 'APPROVED'),
('2024-03-05 18:00:00', '2024-03-05 18:00:00', 'APPROVED'),
('2024-03-10 18:00:00', '2024-03-10 18:00:00', 'APPROVED'),
('2024-03-15 18:00:00', '2024-03-15 18:00:00', 'APPROVED'),
('2024-04-01 18:00:00', '2024-04-01 18:00:00', 'APPROVED'),
('2024-04-05 18:00:00', '2024-04-05 18:00:00', 'APPROVED'),
('2024-04-10 18:00:00', '2024-04-10 18:00:00', 'APPROVED'),
('2024-04-15 18:00:00', '2024-04-15 18:00:00', 'APPROVED'),
('2024-04-20 18:00:00', '2024-04-20 18:00:00', 'APPROVED'),
('2024-04-25 18:00:00', '2024-04-25 18:00:00', 'APPROVED'),
('2024-05-01 18:00:00', '2024-05-01 18:00:00', 'APPROVED'),
('2024-05-05 18:00:00', '2024-05-05 18:00:00', 'APPROVED'),
('2024-05-10 18:00:00', '2024-05-10 18:00:00', 'APPROVED'),
('2024-05-15 18:00:00', '2024-05-15 18:00:00', 'APPROVED'),
('2024-05-20 18:00:00', '2024-05-20 18:00:00', 'APPROVED'),
('2024-05-25 18:00:00', '2024-05-25 18:00:00', 'APPROVED'),
('2024-06-25 18:00:00', '2024-06-25 18:00:00', 'APPROVED'),
('2024-07-01 18:00:00', '2024-07-01 18:00:00', 'REJECTED'),
('2024-09-01 18:00:00', '2024-09-01 18:00:00', 'REJECTED'),
('2024-09-05 18:00:00', '2024-09-05 18:00:00', 'REJECTED'),
('2024-10-28 18:00:00', '2024-10-28 18:00:00', 'PENDING'),
('2024-11-05 18:00:00', '2024-11-05 18:00:00', 'PENDING');

-- 이벤트용
INSERT INTO gatherings (b_code, current_number, h_code, max_number, x, y, appointed_at, created_at, deadline, event_gathering_id, hits, modified_at, organizer_id, title, description, address_name, region_1depth_name, region_2depth_name, region_3depth_name, thumbnail_url, concept, gathering_type, goal_distance, status, is_normal_completed)
VALUES
(0, 40, 0, 10,0.0,0.0, '2024-01-01 18:00:00', '2024-01-01 18:00:00', '2024-01-02 18:00:00', 1,  0, '2024-01-01 18:00:00', 1, '서울 강남구에서 열리는 이벤트', '강남에서의 모임.', '서울특별시 강남구 역삼로 123', '서울특별시', '강남구', '역삼동', 'thumbnail1.jpg', 'RUNLINI', 'EVENT', 'THREE_KM', 'NORMAL',0),
(0, 20, 0, 10,0.0, 0.0, '2024-01-05 18:00:00', '2024-01-05 18:00:00', '2024-01-06 18:00:00', 2,  0, '2024-01-05 18:00:00', 4, '부산 해운대구에서 열리는 이벤트', '부산에서의 모임.', '부산광역시 해운대구 해운대해변로 140', '부산광역시', '해운대구', '해운대', 'thumbnail2.jpg', 'HEALTH', 'EVENT', 'FREE', 'NORMAL',0),
(0, 35, 0, 10,0.0, 0.0, '2024-01-10 18:00:00', '2024-01-10 18:00:00', '2024-01-11 18:00:00', 3,  0, '2024-01-10 18:00:00', 9, '대구 중구에서 열리는 이벤트', '대구에서 만나요.', '대구광역시 중구 동성로 123', '대구광역시', '중구', '동성로', 'thumbnail3.jpg', 'GOINMUL', 'EVENT', 'FIVE_KM', 'NORMAL',0),
(0, 10, 0, 10,0.0,0.0, '2024-02-01 18:00:00', '2024-02-01 18:00:00', '2024-02-02 18:00:00', 4,  0, '2024-02-01 18:00:00', 14, '서울 종로구 청계천에서 열리는 이벤트', '서울의 명소.', '서울특별시 종로구 청계천로 1', '서울특별시', '종로구', '청계천', 'thumbnail7.jpg', 'HEALTH', 'EVENT', 'FULL_MARATHON', 'NORMAL',0),
(0, 22, 0, 10,0.0, 0.0, '2024-02-05 18:00:00', '2024-02-05 18:00:00', '2024-02-06 18:00:00', 5,  0, '2024-02-05 18:00:00', 15, '부산 사하구 다대포에서 열리는 이벤트', '다대포에서.', '부산광역시 사하구 다대포해안로 140', '부산광역시', '사하구', '다대포', 'thumbnail8.jpg', 'RUNLINI', 'EVENT', 'FREE', 'NORMAL',0),
(0, 50, 0, 10,0.0,0.0, '2024-03-01 18:00:00', '2024-03-01 18:00:00', '2024-03-02 18:00:00', 6,  0, '2024-03-01 18:00:00', 20, '서울 마포구 홍대에서 열리는 이벤트', '홍대에서의 모임.', '서울특별시 마포구 양화로 123', '서울특별시', '마포구', '홍대', 'thumbnail13.jpg', 'HEALTH', 'EVENT', 'THREE_KM', 'NORMAL',0),
(0, 40, 0, 10,0.0, 0.0, '2024-03-05 18:00:00', '2024-03-05 18:00:00', '2024-03-06 18:00:00', 7,  0, '2024-03-05 18:00:00', 22, '부산 영도구 영도에서 열리는 이벤트', '영도에서의 모임.', '부산광역시 영도구 해양로 140', '부산광역시', '영도구', '영도', 'thumbnail14.jpg', 'EVENING_RUNNING', 'EVENT', 'FIFTEEN_KM', 'NORMAL',0),
(0, 30, 0, 10,0.0, 0.0, '2024-03-10 18:00:00', '2024-03-10 18:00:00', '2024-03-11 18:00:00', 8,  0, '2024-03-10 18:00:00', 24, '대구 동구 신천에서 열리는 이벤트', '신천에서의 모임.', '대구광역시 동구 신천동 1', '대구광역시', '동구', '신천', 'thumbnail15.jpg', 'HEALTH', 'EVENT', 'FULL_MARATHON', 'NORMAL',0),
(0, 20, 0, 10,0.0, 0.0, '2024-03-15 18:00:00', '2024-03-15 18:00:00', '2024-03-16 18:00:00', 9,  0, '2024-03-15 18:00:00', 26, '인천 미추홀구 주안에서 열리는 이벤트', '주안에서의 모임.', '인천광역시 미추홀구 주안동 1', '인천광역시', '미추홀구', '주안', 'thumbnail16.jpg', 'HEALTH', 'EVENT', 'FREE', 'NORMAL',0),
(0, 20, 0, 10,0.0,0.0, '2024-04-01 18:00:00', '2024-04-01 18:00:00', '2024-04-02 18:00:00', 10,  0, '2024-04-01 18:00:00', 27, '서울 송파구 잠실에서 열리는 이벤트', '잠실에서의 모임.', '서울특별시 송파구 올림픽로 1', '서울특별시', '송파구', '잠실', 'thumbnail19.jpg', 'GOINMUL', 'EVENT', 'FIVE_KM', 'NORMAL',0),
(0, 25, 0, 10,0.0, 0.0, '2024-04-05 18:00:00', '2024-04-05 18:00:00', '2024-04-06 18:00:00', 11,  0, '2024-04-05 18:00:00', 30, '부산 동래구 온천에서 열리는 이벤트', '온천장에서의 모임.', '부산광역시 동래구 온천동 1', '부산광역시', '동래구', '온천', 'thumbnail20.jpg', 'HEALTH', 'EVENT', 'FREE', 'NORMAL',0),
(0, 30, 0, 10,0.0, 0.0, '2024-04-10 18:00:00', '2024-04-10 18:00:00', '2024-04-11 18:00:00', 12,  0, '2024-04-10 18:00:00', 32, '대구 서구 비산에서 열리는 이벤트', '비산동에서의 모임.', '대구광역시 서구 비산동 1', '대구광역시', '서구', '비산', 'thumbnail21.jpg', 'HEALTH', 'EVENT', 'THREE_KM', 'NORMAL',0),
(0, 45, 0, 10,0.0, 0.0, '2024-04-15 18:00:00', '2024-04-15 18:00:00', '2024-04-16 18:00:00', 13,  0, '2024-04-15 18:00:00', 34, '인천 남구 숭의동에서 열리는 이벤트', '숭의동에서의 모임.', '인천광역시 남구 숭의동 1', '인천광역시', '남구', '숭의동', 'thumbnail22.jpg', 'MORNING_RUNNING', 'EVENT', 'FREE', 'NORMAL',0),
(0, 30, 0, 10,0.0, 0.0, '2024-04-20 18:00:00', '2024-04-20 18:00:00', '2024-04-21 18:00:00', 14,  0, '2024-04-20 18:00:00', 27, '광주 서구 상무에서 열리는 이벤트', '상무에서의 모임.', '광주광역시 서구 상무동 1', '광주광역시', '서구', '상무', 'thumbnail23.jpg', 'HEALTH', 'EVENT', 'FULL_MARATHON', 'NORMAL',0),
(0, 25, 0, 10,0.0, 0.0, '2024-04-25 18:00:00', '2024-04-25 18:00:00', '2024-04-26 18:00:00', 15,  0, '2024-04-25 18:00:00', 39, '세종시 조치원읍에서 열리는 이벤트', '조치원에서의 모임.', '세종특별자치시 조치원읍 1', '세종특별자치시', '세종시', '조치원', 'thumbnail24.jpg', 'EVENING_RUNNING', 'EVENT', 'THREE_KM', 'NORMAL',0),
(0, 15, 0, 10,0.0,0.0, '2024-05-01 18:00:00', '2024-05-01 18:00:00', '2024-05-02 18:00:00', 16,  0, '2024-05-01 18:00:00', 41, '서울 강서구 화곡에서 열리는 이벤트', '화곡에서의 모임.', '서울특별시 강서구 화곡로 1', '서울특별시', '강서구', '화곡', 'thumbnail25.jpg', 'GOINMUL', 'EVENT', 'FREE', 'NORMAL',0),
(0, 50, 0, 10,0.0, 0.0, '2024-05-05 18:00:00', '2024-05-05 18:00:00', '2024-05-06 18:00:00', 17,  0, '2024-05-05 18:00:00', 42, '부산 해운대구 해운대에서 열리는 이벤트', '해운대에서의 모임.', '부산광역시 해운대구 해운대해변로 1', '부산광역시', '해운대구', '해운대', 'thumbnail26.jpg', 'HEALTH', 'EVENT', 'FREE', 'NORMAL',0),
(0, 40, 0, 10,0.0, 0.0, '2024-05-10 18:00:00', '2024-05-10 18:00:00', '2024-05-11 18:00:00', 18,  0, '2024-05-10 18:00:00', 51, '대구 중구 동성로에서 열리는 이벤트', '동성로에서의 모임.', '대구광역시 중구 동성로 1', '대구광역시', '중구', '동성로', 'thumbnail27.jpg', 'RUNLINI', 'EVENT', 'THREE_KM', 'NORMAL',0),
(0, 40, 0, 10,0.0, 0.0, '2024-05-15 18:00:00', '2024-05-15 18:00:00', '2024-05-16 18:00:00', 19,  0, '2024-05-15 18:00:00', 54, '인천 부평구 부평에서 열리는 이벤트', '부평에서의 모임.', '인천광역시 부평구 부평동 1', '인천광역시', '부평구', '부평', 'thumbnail28.jpg', 'EVENING_RUNNING', 'EVENT', 'FULL_MARATHON', 'NORMAL',0),
(0, 50, 0, 10,0.0, 0.0, '2024-05-20 18:00:00', '2024-05-20 18:00:00', '2024-05-21 18:00:00', 20,  0, '2024-05-20 18:00:00', 56, '광주 광산구 광산에서 열리는 이벤트', '광산구에서의 모임.', '광주광역시 광산구 광산동 1', '광주광역시', '광산구', '광산', 'thumbnail29.jpg', 'MORNING_RUNNING', 'EVENT', 'THREE_KM', 'NORMAL',0),
(0, 60, 0, 10,0.0, 0.0, '2024-05-25 18:00:00', '2024-05-25 18:00:00', '2024-05-26 18:00:00', 21,  0, '2024-05-25 18:00:00', 57, '세종시 세종에서 열리는 이벤트', '세종시에서의 모임.', '세종특별자치시 세종로 1', '세종특별자치시', '세종시', '세종', 'thumbnail30.jpg', 'HEALTH', 'EVENT', 'FREE', 'NORMAL',0),
(0, 15, 0, 10,0.0, 0.0, '2024-06-25 18:00:00', '2024-06-25 18:00:00', '2024-06-26 18:00:00', 22,  0, '2024-06-25 18:00:00', 60, '인천시 에서 열리는 이벤트', '세종에서의 모임.', '세종특별자치시 세종로 2', '세종특별자치시', '세종시', '세종', 'thumbnail36.jpg', 'MORNING_RUNNING', 'EVENT', 'FULL_MARATHON', 'NORMAL',0),
(0, 12, 0, 10,0.0,0.0, '2024-07-01 18:00:00', '2024-07-01 18:00:00', '2024-07-02 18:00:00', 23,  0, '2024-07-01 18:00:00', 19, '서울 관악구 서울대에서 열리는 이벤트', '서울대에서의 모임.', '서울특별시 관악구 관악로 1', '서울특별시', '관악구', '서울대', 'thumbnail37.jpg', 'HEALTH', 'EVENT', 'THREE_KM', 'NORMAL',0),
(0, 50, 0, 10,0.0,0.0, '2024-09-01 18:00:00', '2024-09-01 18:00:00', '2024-09-02 18:00:00', 24,  0, '2024-09-01 18:00:00', 18, '서울 성동구 성수동에서 열리는 이벤트', '성수동에서의 모임.', '서울특별시 성동구 성수동 1', '서울특별시', '성동구', '성수동', 'thumbnail49.jpg', 'HEALTH', 'EVENT', 'FREE', 'NORMAL',0),
(0, 40, 0, 10,0.0, 0.0, '2024-09-05 18:00:00', '2024-09-05 18:00:00', '2024-09-06 18:00:00', 25,  0, '2024-09-05 18:00:00', 11, '대구 수성구 범어에서 열리는 이벤트', '범어에서의 모임.', '대구광역시 수성구 범어동 3', '대구광역시', '수성구', '범어', 'thumbnail50.jpg', 'HEALTH', 'EVENT', 'THREE_KM', 'NORMAL',0),
(0, 50, 0, 10,0.0,0.0, '2024-10-28 18:00:00', '2024-10-28 18:00:00', '2024-10-28 18:00:00', 26,  0, '2024-09-01 18:00:00', 63, '서울 성동구 성수동에서 열리는 이벤트', '성수동에서의 모임.', '서울특별시 성동구 성수동 1', '서울특별시', '성동구', '성수동', 'thumbnail49.jpg', 'HEALTH', 'EVENT', 'FREE', 'NORMAL',0),
(0, 40, 0, 10,0.0, 0.0, '2024-11-05 18:00:00', '2024-11-05 18:00:00', '2024-11-05 18:00:00', 27,  0, '2024-09-05 18:00:00', 64, '대구 수성구 범어에서 열리는 이벤트', '범어에서의 모임.', '대구광역시 수성구 범어동 3', '대구광역시', '수성구', '범어', 'thumbnail50.jpg', 'HEALTH', 'EVENT', 'THREE_KM', 'NORMAL',0);


